#include<stdio.h>
int main()
{ 
    char s1[100] = {0}; 
    char s2[50] = {0}; 
    int i = 0, j = 0; 
    printf("请输入字符串s1："); 
    scanf("%s", s1); 
    printf("请输入字符串s2："); 
    scanf("%s", s2); 
    printf("将s2拼接在s1之后: "); 
    while ((s1[i]!= '\0'))                     //找到s1的末尾 
    {  
        i++; 
    } 
    while ((s1[i++] = s2[j++]));         //将s2中的字符逐个往s1之后拼接 
    printf("%s\n", s1); 
    return 0;
}

//这里出现的一个while的用法
//while语句的执行特点是只有当条件满足为真的时候才会继续循环
//此时，若把赋值语句看作为一个条件，则正常的赋值便为真，而char类型的'\0'的赋值则会给while返回一个“假”值（既是0）从而使得循环中断
//然后通过这种性质就能过实现代码中遇到'\0'就跳出循环的效果